### Student management system

Student Management System (SMS), is designed to store relational database with multiple tables. Each table will store related data, and these tables will be connected using foreign keys.
Here are tables that are used in sms.

### Tables for the Student Management System

- Students Table: Stores personal information about the students.

- Courses Table: Stores the information about the courses offered.

- Enrollments Table: Connects students to the courses they are enrolled in.

- Departments Table: Stores details about different departments.

- Professors Table: Stores information about the professors who teach courses.

- Grades Table: Stores grades for students in different courses.

Students Table

- This table will store information about each student, such as their name, date of birth, and department.

In [21]:
%load_ext sql
%sql sqlite:///students.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Students Table

- This table will store information about each student, such as their name, date of birth,Email and department.

In [25]:
%%sql
drop table if exists students;
Create table students (
    student_id INTEGER PRIMARY KEY,
    first_name varchar(50),
    last_name varchar(50),
    birth_date date,
    email varchar(100) unique,
    department_id int,
    foreign key (department_id) references departments(department_id)
);

 * sqlite:///students.db
Done.
Done.

[]

Courses Table

- This table will store information about courses that are available.

In [26]:
%%sql
drop table if exists courses;
create table courses (
    course_id INTEGER PRIMARY KEY,
    course_name varchar(100),
    department_id int,
    professor_id int,
    foreign key (department_id) references departments(department_id),
    foreign key (professor_id) references professors(professor_id)
);

 * sqlite:///students.db
Done.
Done.

[]

Enrollments Table

- This table will connect students with the courses they are enrolled in. It is a many-to-many relationship because one student can enroll in multiple courses and each course can have multiple students.

In [27]:
%%sql
drop table if exists enrollments;
create table enrollments (
    enrollment_id INTEGER PRIMARY KEY,
    student_id int,
    course_id int,
    enrollment_date date,
    grade varchar(2),
    foreign key (student_id) references students(student_id),
    foreign key (course_id) references courses(course_id)
);

 * sqlite:///students.db
Done.
Done.

[]

Departments Table

- This table stores information about the different departments within the institution, such as Computer Science, Engineering, etc

In [28]:
%%sql
drop table if exists departments;
create table departments (
    department_id INTEGER PRIMARY KEY,
    department_name varchar(100)
);

 * sqlite:///students.db
Done.
Done.

[]

 Professors Table

- This table will store information about the professors who teach the courses.

In [29]:
%%sql
drop table if exists professors;
create table professors (
    professor_id INTEGER PRIMARY KEY,
    first_name varchar(50),
    last_name varchar(50),  
    department_id int,
    foreign key (department_id) references departments(department_id)
);

 * sqlite:///students.db
Done.
Done.

[]

Grades Table

- This table will store the grades that students get in each course they are enrolled in.

In [30]:
%%sql
drop table if exists grades;
create table grades (
    grade_id INTEGER PRIMARY KEY,
    student_id int,
    course_id int,
    grade varchar(2),
    foreign key (student_id) references students(student_id),
    foreign key (course_id) references courses(course_id)   
);

 * sqlite:///students.db
Done.
Done.

[]

Inserting Data into Table students.

In [32]:
%%sql
INSERT INTO students (student_id,first_name, last_name,birth_date, email, department_id)
VALUES (101,'John', 'Rai', '2000-05-14', 'john.rai@example.com', 1);

 * sqlite:///students.db
1 rows affected.

[]

Inserting Data into Table Course

In [33]:
%%sql
INSERT INTO courses (course_id,course_name, department_id, professor_id)
VALUES(1002,'Operating Systems', 1, 2);

 * sqlite:///students.db
1 rows affected.

[]

Inserting Data into table enrollment

In [34]:
%%sql
INSERT INTO enrollments (enrollment_id, student_id, course_id, enrollment_date, grade)
VALUES
    (1, 1, 1, '2024-01-10', 'A');

 * sqlite:///students.db
1 rows affected.

[]

Inserting data into department table

In [35]:
%%sql
INSERT INTO departments (department_id, department_name)
VALUES
    (1, 'Computer Science'),
    (2, 'Information Technology'),
    (6, 'Data Science');

 * sqlite:///students.db
3 rows affected.

[]

Inserting data into professor table

In [36]:
%%sql
INSERT INTO professors (professor_id, first_name, last_name, department_id)
VALUES
    (1, 'Rahul', 'Thapa', 1),
    (2, 'Jenisha', 'rai', 2),
    (3, 'Anil', 'Khadka', 3);

 * sqlite:///students.db
3 rows affected.

[]

Inserting data into grade table

In [37]:
%%sql
INSERT INTO grades (grade_id, student_id, course_id, grade)
VALUES
    (1, 1, 1, 'A'),
    (2, 1, 2, 'B');

 * sqlite:///students.db
2 rows affected.

[]

SQL Filter Operations (Using the WHERE Clause)

The WHERE clause in SQL is used to filter records based on specific conditions. It is commonly used to extract only those records that meet certain 
condition.

Here some operations like comparisons, logical conditions will perform.

In [38]:
%%sql
SELECT * 
FROM students 
WHERE department_id = 1;

 * sqlite:///students.db
Done.

[(101, 'John', 'Rai', '2000-05-14', 'john.rai@example.com', 1)]